import { Body, Container } from '../../../shared';

export const SurveyResults = () => {
  return (
    <section className="bg-extralightGray px-4 py-4 1920:py-[68px]">
      <Container className="grid grid-cols-1 gap-5 1920:grid-cols-2 1920:gap-8">
        <div className="space-y-3.5 md:space-y-[46px] 1920:space-y-[17px]">
          <Body size={18} weight="semibold">
            Опрошенных пользовались микрокредитами
          </Body>
          <Body size={16} weight="regular">
            Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах
          </Body>
        </div>
        <div className="space-y-3.5 md:space-y-[46px] 1920:space-y-[17px]">
          <Body size={18} weight="semibold">
            Опрошенных пользовались микрокредитами
          </Body>
          <Body size={16} weight="regular">
            Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафахНе могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах
          </Body>
        </div>
        <div className="space-y-3.5 md:space-y-[46px] 1920:space-y-[17px]">
          <Body size={18} weight="semibold">
            Опрошенных пользовались микрокредитами
          </Body>
          <Body size={16} weight="regular">
            Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафахНе могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах
          </Body>
        </div>
        <div className="space-y-3.5 md:space-y-[46px] 1920:space-y-[17px]">
          <Body size={18} weight="semibold">
            Опрошенных пользовались микрокредитами
          </Body>
          <Body size={16} weight="regular">
            Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах
          </Body>
        </div>
      </Container>
    </section>
  );
};
